espressif/arduino-esp32/libraries/WiFi/src/WiFiGeneric.cpp
/*
 ESP8266WiFiGeneric.cpp - WiFi library for esp8266

 Copyright (c) 2014 Ivan Grokhotkov. All rights reserved.
 This file is part of the esp8266 core for Arduino environment.

 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.

 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 Lesser General Public License for more details.

 You should have received a copy of the GNU Lesser General Public
 License along with this library; if not, write to the Free Software
 Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

 Reworked on 28 Dec 2015 by Markus Sattler

 */

#include "WiFi.h"
#include "WiFiGeneric.h"
#if SOC_WIFI_SUPPORTED || CONFIG_ESP_WIFI_REMOTE_ENABLED

extern "C" {
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>
#include <string.h>

#include <esp_err.h>
#include <esp_wifi.h>
#include <esp_event.h>
#include <esp_mac.h>
#include <esp_netif.h>
#if SOC_WIFI_SUPPORTED
#include <esp_phy.h>
#endif
#include "lwip/ip_addr.h"
#include "lwip/opt.h"
#include "lwip/err.h"
#include "lwip/dns.h"
#include "lwip/netif.h"
#include "dhcpserver/dhcpserver.h"
#include "dhcpserver/dhcpserver_options.h"

}  //extern "C"

#include "esp32-hal.h"
#include <vector>
#include "sdkconfig.h"

static esp_netif_t *esp_netifs[ESP_IF_MAX] = {NULL, NULL, NULL};
// a static handle for event callback
static network_event_handle_t evt_handle{0};
static esp_event_handler_instance_t evt_wifi_handle{nullptr};
#if !CONFIG_ESP_WIFI_REMOTE_ENABLED
static esp_event_handler_instance_t evt_sc_handle{nullptr};
#if CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI
static esp_event_handler_instance_t evt_nprov_handle{nullptr};
#endif  // CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI
#endif  //!CONFIG_ESP_WIFI_REMOTE_ENABLED

esp_netif_t *get_esp_interface_netif(esp_interface_t interface) {
  if (interface < ESP_IF_MAX) {
    return esp_netifs[interface];
  }
  return NULL;
}

static void _arduino_event_cb(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data) {
  arduino_event_t arduino_event;
  arduino_event.event_id = ARDUINO_EVENT_ANY;

  if (event_base == WIFI_EVENT){
    switch (event_id){
      case WIFI_EVENT_STA_WPS_ER_SUCCESS :
        Network.postEvent(ARDUINO_EVENT_WPS_ER_SUCCESS);
        return;
      case WIFI_EVENT_STA_WPS_ER_TIMEOUT :
        Network.postEvent(ARDUINO_EVENT_WPS_ER_TIMEOUT);
        return;
      case WIFI_EVENT_STA_WPS_ER_PBC_OVERLAP :
        Network.postEvent(ARDUINO_EVENT_WPS_ER_PBC_OVERLAP);
        return;
      case WIFI_EVENT_SCAN_DONE : {
        #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
        wifi_event_sta_scan_done_t *event = (wifi_event_sta_scan_done_t *)event_data;
        log_v("SCAN Done: ID: %u, Status: %u, Results: %u", event->scan_id, event->status, event->number);
        #endif
        arduino_event.event_id = ARDUINO_EVENT_WIFI_SCAN_DONE;
        memcpy(&arduino_event.event_info.wifi_scan_done, event_data, sizeof(wifi_event_sta_scan_done_t));
        break;
      }
      case WIFI_EVENT_STA_WPS_ER_FAILED :
        arduino_event.event_id = ARDUINO_EVENT_WPS_ER_FAILED;
        memcpy(&arduino_event.event_info.wps_fail_reason, event_data, sizeof(wifi_event_sta_wps_fail_reason_t));
        break;
      case WIFI_EVENT_STA_WPS_ER_PIN :
        arduino_event.event_id = ARDUINO_EVENT_WPS_ER_PIN;
        memcpy(&arduino_event.event_info.wps_fail_reason, event_data, sizeof(wifi_event_sta_wps_er_pin_t));
        break;
      case WIFI_EVENT_FTM_REPORT :
        arduino_event.event_id = ARDUINO_EVENT_WIFI_FTM_REPORT;
        memcpy(&arduino_event.event_info.wifi_ftm_report, event_data, sizeof(wifi_event_ftm_report_t));
        break;
      default:
        return;
    }
  }

#if !CONFIG_ESP_WIFI_REMOTE_ENABLED
  if (event_base == SC_EVENT){
    switch (event_id){
      case SC_EVENT_SCAN_DONE :
        log_v("SC Scan Done");
        Network.postEvent(ARDUINO_EVENT_SC_SCAN_DONE);
        return;
      case SC_EVENT_FOUND_CHANNEL :
        log_v("SC Found Channel");
        Network.postEvent(ARDUINO_EVENT_SC_FOUND_CHANNEL);
        return;
      case SC_EVENT_GOT_SSID_PSWD : {
        #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
        smartconfig_event_got_ssid_pswd_t *event = (smartconfig_event_got_ssid_pswd_t *)event_data;
        log_v("SC: SSID: %s, Password: %s", (const char *)event->ssid, (const char *)event->password);
        #endif
        arduino_event.event_id = ARDUINO_EVENT_SC_GOT_SSID_PSWD;
        memcpy(&arduino_event.event_info.sc_got_ssid_pswd, event_data, sizeof(smartconfig_event_got_ssid_pswd_t));
        break;
      }
      case SC_EVENT_SEND_ACK_DONE :
        log_v("SC Send Ack Done");
        Network.postEvent(ARDUINO_EVENT_SC_SEND_ACK_DONE);
        return;
      default:
        return;
    }
  }

#if CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI
  /*
	 * Provisioning
   */
  if (event_base == NETWORK_PROV_EVENT){
    switch (event_id){
      case NETWORK_PROV_INIT :
        log_v("Provisioning Initialized!");
        Network.postEvent(ARDUINO_EVENT_PROV_INIT);
        return;
      case NETWORK_PROV_DEINIT :
        log_v("Provisioning Uninitialized!");
        Network.postEvent(ARDUINO_EVENT_PROV_DEINIT);
        return;
      case NETWORK_PROV_START :
        log_v("Provisioning Start!");
        Network.postEvent(ARDUINO_EVENT_PROV_START);
        return;
      case NETWORK_PROV_END :
        log_v("Provisioning End!");
        network_prov_mgr_deinit();
        Network.postEvent(ARDUINO_EVENT_PROV_END);
        return;
      case NETWORK_PROV_WIFI_CRED_RECV : {
        #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
        wifi_sta_config_t *event = (wifi_sta_config_t *)event_data;
        log_v("Provisioned Credentials: SSID: %s, Password: %s", (const char *)event->ssid, (const char *)event->password);
        #endif
        arduino_event.event_id = ARDUINO_EVENT_PROV_CRED_RECV;
        memcpy(&arduino_event.event_info.prov_cred_recv, event_data, sizeof(wifi_sta_config_t));
        break;
      }
      case NETWORK_PROV_WIFI_CRED_FAIL : {
        #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_ERROR
        network_prov_wifi_sta_fail_reason_t *reason = (network_prov_wifi_sta_fail_reason_t *)event_data;
        log_e("Provisioning Failed: Reason : %s", (*reason == NETWORK_PROV_WIFI_STA_AUTH_ERROR) ? "Authentication Failed" : "AP Not Found");
        #endif
        arduino_event.event_id = ARDUINO_EVENT_PROV_CRED_FAIL;
        memcpy(&arduino_event.event_info.prov_fail_reason, event_data, sizeof(network_prov_wifi_sta_fail_reason_t));
        break;
      }
      case NETWORK_PROV_WIFI_CRED_SUCCESS :
        log_v("Provisioning Success!");
        Network.postEvent(ARDUINO_EVENT_PROV_CRED_SUCCESS);
        return;
      default:
        return;
    }
  }
#endif  // CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI
#endif  //!CONFIG_ESP_WIFI_REMOTE_ENABLED

  Network.postEvent(&arduino_event);
}

